Documents/ПриемТовараНаХранение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПриемТовараНаХранение</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ХранениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиСебестоимость</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКартой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сезонность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПриема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПриема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПродления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоПриема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПервичное</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМСКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_СМС_СД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_СтоимостьХраненияШинИДисков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПротэктора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сезон</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Сезонность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеТовара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьЗаМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ХранениеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ХранениеТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументХранения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПартийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыПартийТоваров</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Купленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратнаяТараОтложеннаяОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КупленныйОтложеннаяОтгрузка</Name>
					<Comment>Купленный отложенная отгрузка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриемТовараНаХранение/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.                              
	
	//+БП: d.matyash (20.02.2025) <>
	Если ДанныеЗаполнения = Неопределено тогда 
		Возврат;
	КонецЕсли;
	//-БП: d.matyash (20.02.2025) <>   
	
	Склад = ДанныеЗаполнения.СкладГруппа;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Организация = ДанныеЗаполнения.Организация;
	Сделка = ДанныеЗаполнения;
	СуммаХранения = ДанныеЗАполнения.Услуги.Итог("Сумма");
	ДатаС = ТекущаяДата();
	ДатаПо = ТекущаяДата()+365*24*60*60;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ХранениеТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ХранениеТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ДокументХранения = Ссылка;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;   
	
	//С.Д. Сеня 15,05,24 +
	//1. В документі [прийом на храненія] прибрати рухи по всім регістрам крім ʼхраненияʼ з 01/05/2024
	Если НачалоДня(Дата) < Дата("20240501") Тогда 	
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДоговорКонтрагента = Сделка.ДоговорКонтрагента;
		Движение.Сделка = Сделка;
		Движение.Организация = Сделка.Организация;
		Движение.Контрагент = Контрагент;
		Движение.СуммаВзаиморасчетов = СуммаХранения;
		Движение.СуммаУпр = СуммаХранения;
		
		Движения.ЗаказыПокупателей.Записывать = Истина;
		Движения.Продажи.Записывать = Истина;
		Для Каждого Стр  из Сделка.Услуги Цикл
			Движение = Движения.ЗаказыПокупателей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДоговорКонтрагента = Сделка.ДоговорКонтрагента;
			Движение.ЗаказПокупателя = Сделка;
			Движение.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;
			ДВижение.Номенклатура = Стр.Номенклатура;
			Движение.Цена = Стр.Цена;
			ДВижение.СтавкаНДС = Стр.СтавкаНДС;
			ДВижение.Количество = Стр.Количество;
			ДВижение.СуммаВзаиморасчетов = Стр.Сумма;
			ДВижение.СуммаУпр = Стр.Сумма;
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорКонтрагента = Сделка.ДоговорКонтрагента;
			Движение.ДокументПродажи = Ссылка;
			Движение.Контрагент = Контрагент;
			ДВижение.Номенклатура = Стр.Номенклатура;
			Движение.ЗаказПокупателя = Сделка;
			Движение.Подразделение = Сделка.Подразделение;
			Движение.Организация = Сделка.Организация;
			Движение.Количество = Стр.Количество;
			ДВижение.Стоимость = Стр.Сумма;
			Движение.НДС = Стр.СуммаНДС;
			Движение.СтоимостьБезСкидок = Стр.Сумма;
			
			Движения.ПродажиСебестоимость.Записывать = Истина;
			Движение = Движения.ПродажиСебестоимость.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.ЗаказПокупателя = Сделка;
			Движение.Подразделение = Сделка.Подразделение;
			Движение.Количество = Стр.Количество;
			//ДВижение.Стоимость = 50;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура();
	//+БП: d.matyash (23.02.2025) <> 
	СтруктураМакетов.Вставить("АктПриемаДоговор", "Акт приймання-передачі та договір");
	//-БП: d.matyash (23.02.2025) <>
    //+БП: d.matyash (23.02.2025) <>
	//СтруктураМакетов.Вставить("ДоговорСезонногоХранения ","Договор сезонного хранения ");
	//СтруктураМакетов.Вставить("ДоговорСезонногоХраненияУКР", "Договор сезонного хранения (укр)");
	//СтруктураМакетов.Вставить("АктПередачиЮ", "Акт передачи ООО");
	//СтруктураМакетов.Вставить("АктПередачи", "Акт передачи"); 
	//+БП: d.matyash (23.02.2025) <>
	СтруктураМакетов.Вставить("Стикера", "Стикера");	

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьТаблицуПечатныхФорм()

//
Функция ПечатьДоговора()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговор";
	
	//с.д.(
	//Макет = ПолучитьМакет("Макет");
	Макет = ПолучитьМакет("Макет2023");
	//с.д.)
	ОбластьМакета = Макет.ПолучитьОбласть("Договор");
	ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(НомерПервичногоПриема),НомерПервичногоПриема,Номер);
	ОбластьМакета.Параметры.ДатаПр = Формат(Дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
//	ОбластьМакета.Параметры.Кво = Товары.Итог("Количество");
//	Мес = Год(ДатаПо)*12-год(ДатаС)*12 + месяц(ДатаПо)-месяц(ДатаС);
//	ОбластьМакета.Параметры.Мес = Мес;
	//Если Мес = 0 Тогда
	//	ОбластьМакета.Параметры.Стоимость = СуммаХранения;
	//Иначе
	//	ОбластьМакета.Параметры.Стоимость = Окр(СуммаХранения / Мес,2);
	//КонецЕсли;
	//ОбластьМакета.Параметры.ДатаС = Формат(ДатаС,"ДЛФ=DD");
	//ОбластьМакета.Параметры.ДатаПо = Формат(ДатаПо,"ДЛФ=DD");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
//	ОбластьМакета.Параметры.Адрес = Адрес;
	ОбластьМакета.Параметры.Телефон = Телефон;
	Паспорт = "";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Организация);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	
	ОбластьМакета.Параметры.Организация = Организация.НаименованиеПолное;
	
	СведенияОПоставщике 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата,,,"uk");
	РуководителиОрганизации = ОбщегоНазначения.ОтветственныеЛицаОрганизации(Организация, Дата);
	
ОбластьМакета.Параметры.ОрганизацияСВ = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,/,КодПоЕДРПОУ,КодПоДРФО,Телефоны,/,ИНН,НомерСвидетельства,",,"uk")
				+ "," + Символы.ПС + НСтр("ru='Р/с ';uk='Р/р '","uk") + Организация.ОсновнойБанковскийСчет.НомерСчета + ", Банк " + Организация.ОсновнойБанковскийСчет.Банк + ", МФО " + Организация.ОсновнойБанковскийСчет.Код + "," + Символы.ПС	
		        + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,/,ПлательщикНалогаНаПрибыль,",,"uk");
				
				
	СведенияОПоставщике 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, Дата,,,"uk");
	
ОбластьМакета.Параметры.контрагентСВ = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КодПоЕДРПОУ,КодПоДРФО,/,ИНН,НомерСвидетельства,/,ПлательщикНалогаНаПрибыль,",,"uk")+ Символы.ПС	
		        + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ФактическийАдрес,",,"uk");
				
				
	ОбластьМакета.Параметры.директорО = РуководителиОрганизации.Руководитель;
	//ОбластьМакета.Параметры.СчетО = СчетО;
	//ОбластьМакета.Параметры.ИПН = ИПН;
	//ОбластьМакета.Параметры.Налог = Налог;
	//      
	//с.д.(
	ОбластьМакета.Параметры.Дата1 = ""+Формат(ДатаС,"Л=uk; ДЛФ=DD");//+"р.";\
	ОбластьМакета.Параметры.Дата2 = ""+Формат(ДатаПо,"Л=uk; ДЛФ=DD");//+"р.";
	//с.д.)
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()

Функция ПечатьДоговораУКР()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговорУкр";
	
	Макет = ПолучитьМакет("МакетУКР");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Договор");
	ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(НомерПервичногоПриема),НомерПервичногоПриема,Номер);
	ОбластьМакета.Параметры.Дата = Дата;
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.Особа = СокрЛП(ДоверенноеЛицо);
	ОбластьМакета.Параметры.Доверенность = СокрЛП(Доверенность);
	
	
//	ОбластьМакета.Параметры.Кво = Товары.Итог("Количество");
	Мес = Год(ДатаПо)*12-год(ДатаС)*12 + месяц(ДатаПо)-месяц(ДатаС);
//	ОбластьМакета.Параметры.Мес = Мес;
	//Если Мес = 0 Тогда
	//	ОбластьМакета.Параметры.Стоимость = СуммаХранения;
	//Иначе
	//	ОбластьМакета.Параметры.Стоимость = Окр(СуммаХранения / Мес,2);
	//КонецЕсли;
	//ОбластьМакета.Параметры.ДатаС = Формат(ДатаС,"ДЛФ=DD");
	//ОбластьМакета.Параметры.ДатаПо = Формат(ДатаПо,"ДЛФ=DD");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
//	ОбластьМакета.Параметры.Адрес = Адрес;
	//ОбластьМакета.Параметры.Телефон = Телефон;
	Паспорт = "";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Организация);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	
	//ОбластьМакета.Параметры.Организация = Организация.НаименованиеПолное;
	
	СведенияОПоставщике 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, Дата,,,"uk");
	РуководителиОрганизации = ОбщегоНазначения.ОтветственныеЛицаОрганизации(Контрагент, Дата);
	
ОбластьМакета.Параметры.Паспорт = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КодПоЕДРПОУ,КодПоДРФО,Телефоны,/,ИНН,НомерСвидетельства,",,"uk")
				+ "," + Символы.ПС + НСтр("ru='Р/с ';uk='Р/р '","uk") + Организация.ОсновнойБанковскийСчет.НомерСчета + ", Банк " + Организация.ОсновнойБанковскийСчет.Банк + ", МФО " + Организация.ОсновнойБанковскийСчет.Код + "," + Символы.ПС	
		        + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,/,ПлательщикНалогаНаПрибыль,",,"uk");
				
				
				
				
	ОбластьМакета.Параметры.директор = ДоверенноеЛицо;
	//ОбластьМакета.Параметры.СчетО = СчетО;
	//ОбластьМакета.Параметры.ИПН = ИПН;
	//ОбластьМакета.Параметры.Налог = Налог;
	//
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()


//
Функция ПечатьАкта()

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговор";
	
	Макет = ПолучитьМакет("МакетАкт");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(НомерПервичногоПриема),НомерПервичногоПриема,Номер);
	ОбластьМакета.Параметры.ДатаПр = Формат(Дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
	КонецЦикла;
//	ОбластьМакета.Параметры.Адрес = Адрес;
	Паспорт = "";
	СведенияОПоставщике 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата,,,"uk");
	РуководителиОрганизации = ОбщегоНазначения.ОтветственныеЛицаОрганизации(Организация, Дата);
	
	ОбластьМакета.Параметры.Организация = Организация.НаименованиеПолное;
	
	ОбластьМакета.Параметры.директорО = РуководителиОрганизации.Руководитель;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	СезонУКР = Сезон;
	СезонУКР = СтрЗаменить(СезонУКР,"Летние","Літні");
	СезонУКР = СтрЗаменить(СезонУКР,"Зимние","Зимні");
	СезонУКР = СтрЗаменить(СезонУКР,"Всесезонные","Всесезонні");
	СезонУКР = СтрЗаменить(СезонУКР,"Грузовой","Грузові");
	СезонУКР = СтрЗаменить(СезонУКР,"Мотошины","Мотошини"); 
	
	СостояниеТовараУКР = СостояниеТовара;
	СостояниеТовараУКР = СтрЗаменить(СостояниеТовараУКР,"Новый","Нові");
	СостояниеТовараУКР = СтрЗаменить(СостояниеТовараУКР,"БУ","БУ");

	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Областьмакета.Параметры.Заполнить(Стр);
		Областьмакета.Параметры.ДОТ = "с "+Формат(ДатаС,"Л=uk_UA; ДФ=dd.MM.yyyy")+" по "+Формат(Датапо,"Л=uk_UA; ДФ=dd.MM.yyyy");
		//Областьмакета.Параметры.ЗалоговаяСтоимость = СуммаХранения;
		ОбластьМакета.Параметры.Комментарий = "" + Стр.Комментарий + ?(стр.ОстатокПротэктора = 0,""," залишок протектора " + стр.ОстатокПротэктора) + " " + СезонУКР + " " + СостояниеТовараУКР;
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Низ");
	Областьмакета.Параметры.Количество = Товары.Итог("Количество");
	Областьмакета.Параметры.ЗалоговаяСтоимость = СуммаХранения;
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	ОбластьМакета.Параметры.Количество = Товары.Итог("Количество");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.Адрес = Адрес;
	ОбластьМакета.Параметры.Телефон = Телефон;
	Паспорт = "";
	
	
	
ОбластьМакета.Параметры.ОрганизацияСВ = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,/,КодПоЕДРПОУ,КодПоДРФО,Телефоны,/,ИНН,НомерСвидетельства,",,"uk")
				+ "," + Символы.ПС + НСтр("ru='Р/с ';uk='Р/р '","uk") + Организация.ОсновнойБанковскийСчет.НомерСчета + ", Банк " + Организация.ОсновнойБанковскийСчет.Банк + ", МФО " + Организация.ОсновнойБанковскийСчет.Код + "," + Символы.ПС	
		        + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,/,ПлательщикНалогаНаПрибыль,",,"uk");
				
	//ОбластьМакета.Параметры.СчетО = СчетО;
	//ОбластьМакета.Параметры.ИПН = ИПН;
	//ОбластьМакета.Параметры.Налог = Налог;
	
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()

Функция ПечатьАктаЮ()

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговорООО";
	
	Макет = ПолучитьМакет("Акт");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(НомерПервичногоПриема),НомерПервичногоПриема,Номер);
//	ОбластьМакета.Параметры.ДатаПр = Формат(Дата,"Л=uk_UA; ДЛФ=DD");
	ОбластьМакета.Параметры.Дата = Формат(Дата,"Л=uk_UA; ДЛФ=DD");
	ОбластьМакета.Параметры.ДатаД = Формат(Сделка.ДоговорКонтрагента.Дата,"Л=uk_UA; ДЛФ=DD");
	ОбластьМакета.Параметры.НомерД = Формат(Сделка.ДоговорКонтрагента.Номер,"Л=uk_UA; ДЛФ=DD");
	
	ОбластьМакета.Параметры.ДатаД = Формат(Дата,"Л=uk_UA; ДЛФ=DD");
	ОбластьМакета.Параметры.НомерД = ?(ЗначениеЗаполнено(НомерПервичногоПриема),НомерПервичногоПриема,Номер);
	
	ОбластьМакета.Параметры.Особа = ДоверенноеЛицо;
	ОбластьМакета.Параметры.Довиреность = Доверенность;
	
	ОбластьМакета.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");	
	ОбластьМакета.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");	
	
	ОбластьМакета.Параметры.Хранение = СуммаХранения;	
	ОбластьМакета.Параметры.Хранениепроп = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаХранения, Константы.ВалютаРегламентированногоУчета.Получить(),"uk");
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	ТабДокумент.Вывести(ОбластьМакета);
	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		Областьмакета.Параметры.Заполнить(Ссылка);
		Областьмакета.Параметры.Заполнить(Стр);
//		Областьмакета.Параметры.ЗалоговаяСтоимость = СуммаХранения;
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Низ");
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	СведенияОПоставщике 	= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, Дата,,,"uk");	
ОбластьМакета.Параметры.Реквизиты = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,/,КодПоЕДРПОУ,КодПоДРФО,Телефоны,/,ИНН,НомерСвидетельства,",,"uk")
				+ "," + Символы.ПС + НСтр("ru='Р/с ';uk='Р/р '","uk") + Организация.ОсновнойБанковскийСчет.НомерСчета + ", Банк " + Организация.ОсновнойБанковскийСчет.Банк + ", МФО " + Организация.ОсновнойБанковскийСчет.Код + "," + Символы.ПС	
		        + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,/,ПлательщикНалогаНаПрибыль,",,"uk");
	ОбластьМакета.Параметры.Дата = Формат(Дата,"Л=uk_UA; ДЛФ=DD");
				
	     ОбластьМакета.Параметры.Подпись =  "______________________"+ДоверенноеЛицо;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()

Функция ПечатьАктПриемаДоговор()
    //+БП: d.matyash (23.02.2025) <>   
	ТабДокумент = Новый ТабличныйДокумент;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриемТовараНаХранение.Ссылка,
	                      |	ПриемТовараНаХранение.Контрагент КАК Контрагент1,
	                      |	ПриемТовараНаХранение.ДатаС,
	                      |	ПриемТовараНаХранение.ДатаПо,
	                      |	ПриемТовараНаХранение.Дата КАК ДатаПриема,
	                      |	ПриемТовараНаХранение.Номер КАК НомерПриема,
	                      |	ПриемТовараНаХранение.ОснованиеПервичное.Номер КАК НомерПриемаП,
	                      |	ПриемТовараНаХранение.ОснованиеПервичное.Дата КАК ДатаПриемаП,
	                      |	ПриемТовараНаХранение.Контрагент.ИНН КАК КонтрагентИНН,
	                      |	ПриемТовараНаХранение.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
	                      |	ПриемТовараНаХранение.Организация.ИНН КАК ОрганизацияИНН,
	                      |	ПриемТовараНаХранение.Организация.ОсновнойБанковскийСчет КАК ОрганизацияОсновнойБанковскийСчет,
	                      |	ПриемТовараНаХранение.Организация КАК Организация,
	                      |	ПриемТовараНаХранение.Организация.НаименованиеПолное КАК ОрганизацияПолное,
	                      |	ПриемТовараНаХранение.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	                      |	ПриемТовараНаХранение.Контрагент КАК Контрагент,
	                      |	ПриемТовараНаХранение.Контрагент.КодПоЕДРПОУ
	                      |ИЗ
	                      |	Документ.ПриемТовараНаХранение КАК ПриемТовараНаХранение
	                      |ГДЕ
	                      |	ПриемТовараНаХранение.Ссылка = &Ссылка");   
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() тогда
		Сообщить("Не вдалося сформувати друковану форму!");
		Возврат ТабДокумент;
	КонецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктПрием";
	
	Макет = ПолучитьМакет("АктПриемаДоговор");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакета.Параметры.Заполнить(Выборка);
	ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(Выборка.НомерПриема),Выборка.НомерПриема,Выборка.НомерПриема);
	ОбластьМакета.Параметры.Дата = Формат(?(ЗначениеЗаполнено(Выборка.ДатаПриема),Выборка.ДатаПриема,Выборка.ДатаПриема),"ДЛФ=DD");
		
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.КонтрагентКодПоЕДРПОУ = ?(ЗначениеЗаполнено(Выборка.КонтрагентКодПоЕДРПОУ), "ЄДРПОУ " + Выборка.КонтрагентКодПоЕДРПОУ, "");
	ОбластьМакета.Параметры.КонтрагентИНН = ?(ЗначениеЗаполнено(Выборка.КонтрагентИНН), "ІПН " + Выборка.КонтрагентИНН, "");    
	
	ОбластьМакета.Параметры.ОрганизацияКодПоЕДРПОУ = ?(ЗначениеЗаполнено(Выборка.ОрганизацияКодПоЕДРПОУ), "ЄДРПОУ " + Выборка.ОрганизацияКодПоЕДРПОУ, "");
	ОбластьМакета.Параметры.ОрганизацияИНН = ?(ЗначениеЗаполнено(Выборка.ОрганизацияИНН), "ІПН " + Выборка.ОрганизацияИНН, ""); 
	ОбластьМакета.Параметры.НомерСчета = ?(ЗначениеЗаполнено(Выборка.НомерСчета), "IBAN " + Выборка.НомерСчета, ""); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон1 = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон1 = Рез.Представление;
		КонецЕслИ;   		
	КонецЦикла;
	ОбластьМакета.Параметры.КонтрагентАдрес = Адрес;
	ОбластьМакета.Параметры.КонтрагентНомер = Телефон1;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Орг";
	ЗАпрос.УстановитьПараметр("Орг",Выборка.Организация);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон1 = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			Телефон1 = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.ОрганизацияАдрес = Адрес;
	ОбластьМакета.Параметры.ОрганизацияНомер = Телефон1;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК Руководитель,
	               |	ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК ДолжностьРуководитель,
	               |	ФИОФизЛицСрезПоследних.Фамилия,
	               |	ФИОФизЛицСрезПоследних.Имя,
	               |	ФИОФизЛицСрезПоследних.Отчество
	               |ИЗ
	               |	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	               |			&Дата,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	
	ЗАпрос.УстановитьПараметр("СтруктурнаяЕдиница",Выборка.Организация);
	ЗАпрос.УстановитьПараметр("Дата",Дата);
	ЗАпрос.УстановитьПараметр("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);

	Рез = ЗАпрос.Выполнить().Выбрать();
	ОрганизацияДиректор = "";
	Пока Рез.Следующий() Цикл
			ОрганизацияДиректор = Строка(Рез.ДолжностьРуководитель) + " " + Врег(Рез.Фамилия)  + " " + Строка(Рез.Имя)  + " " + Строка(Рез.Отчество);			
	КонецЦикла;

	ОбластьМакета.Параметры.ОрганизацияДиректор = ОрганизацияДиректор;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Областьмакета.Параметры.Заполнить(Стр);           
		СтрокаДоп = "";
		Если ЗначениеЗаполнено(Стр.СостояниеТовара) ИЛИ ЗначениеЗаполнено(Стр.ОстатокПротэктора) ИЛИ ЗначениеЗаполнено(Стр.Комментарий) тогда
			СтрокаДоп = " (" + ?(ЗначениеЗаполнено(Стр.СостояниеТовара),Строка(Стр.СостояниеТовара) + "; ","") + ?(ЗначениеЗаполнено(Стр.ОстатокПротэктора),Строка(Стр.ОстатокПротэктора) + " мм; ","") + ?(ЗначениеЗаполнено(Стр.Комментарий),Строка(Стр.Комментарий),"") + ")";	
		КонецЕсли;                              
		Если  СТр.СуммаСкидкиНаценки > 0 тогда
			Областьмакета.Параметры.СтоимостьЗаМесяц = Стр.Сумма / ?(СТр.Количество > 0, СТр.Количество, 1 ) / ?(СТр.КоличествоМесяцев > 0, СТр.КоличествоМесяцев, 1 );	
		КонецЕсли;
		Областьмакета.Параметры.Номенклатура = Строка(Стр.Номенклатура) + СтрокаДоп;
		//	
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//Областьмакета.Параметры.Период =  Формат(Выборка.ДатаС,"Л=uk_UA; ДЛФ=DD") + " по " + Формат(Выборка.ДатаПо,"Л=uk_UA; ДЛФ=DD");   
	Областьмакета.Параметры.ЗДень = Формат(Выборка.ДатаС,"Л=uk_UA; ДФ=dd"); 
	Областьмакета.Параметры.ПоДень = Формат(Выборка.ДатаПо,"Л=uk_UA; ДФ=dd");  
	Областьмакета.Параметры.ЗМесяц = Сред(Формат(Выборка.ДатаС,"Л=uk_UA; ДФ=ddMMMM"),3); 
	Областьмакета.Параметры.ПоМесяц = Сред(Формат(Выборка.ДатаПо,"Л=uk_UA; ДФ=ddMMMM"),3); 
	Областьмакета.Параметры.ЗГод = Формат(Выборка.ДатаС,"Л=uk_UA; ДФ='yyyy ""року""'"); 
	Областьмакета.Параметры.ПоГод = Формат(Выборка.ДатаПо,"Л=uk_UA; ДФ='yyyy ""року""'"); 
	//Областьмакета.Параметры.ИтогСумма = Товары.Итог("Сумма");	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.ОрганизацияПолное = СокрЛП(Выборка.ОрганизацияПолное);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	//-БП: d.matyash (23.02.2025) <>
КонецФункции // ПечатьДокумента()



Функция Стикера()
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговорСтикера";

	//с.д.(  29.03.2023
	//Макет = ПолучитьМакет("Стикера");
	Макет = ПолучитьМакет("Стикера_29032023_СД");
	//с.д.)

	ОбластьМакета = Макет.ПолучитьОбласть("Стикер");
	
	Н = 0;
	Оплата = "Нет";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОбороты.Сделка,
	|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, , , Сделка = &Сделка) КАК ВзаиморасчетыСКонтрагентамиОбороты";
	
	Запрос.УстановитьПараметр("Сделка",Сделка);
	Рез = Запрос.Выполнить().Выбрать();
	пока Рез.Следующий() Цикл
		Оплата = "Да Сумма: "+Строка(Рез.СуммаВзаиморасчетовРасход)+" грн.";
	КонецЦикла;
	Для Каждого Стр из Товары Цикл
		Если Стр.НомерСтроки = 1 Тогда
			Струк2 = Новый Структура;
			Струк2.Вставить("Товар",Стр.Номенклатура);
			Струк2.Вставить("Кво",Строка(Стр.Количество)+" шт.");
			ОбластьМакета = Макет.ПолучитьОбласть("Товар1");
			ОбластьМакета.Параметры.Заполнить(Струк2);
			ТабДокумент.Вывести(ОбластьМакета);		
			
		Иначе
			Струк2 = Новый Структура;
			Струк2.Вставить("Товар",Стр.Номенклатура);
			Струк2.Вставить("Кво",Строка(Стр.Количество)+" шт.");
			ОбластьМакета = Макет.ПолучитьОбласть("Товар2");
			ОбластьМакета.Параметры.Заполнить(Струк2);
			ТабДокумент.Вывести(ОбластьМакета);		
			
			
		КонецЕслИ;
	КонецЦикла;		
	Струк1 = Новый Структура;
	Струк1.Вставить("Телефон",Сделка.Телефон);
	Струк1.Вставить("ДоверенноеЛицо",Контрагент.Наименование);
	//+БП: d.matyash (21.02.2025) <>
	//Струк1.Вставить("Номер",Номер);
	//------------------------------     
	Струк1.Вставить("Номер",НомерПервичногоПриема);
	//-БП: d.matyash (21.02.2025) <>
	Струк1.Вставить("Период","с "+Формат(ДатаС,"ДФ=dd.MM.yyyy")+" по "+Формат(ДатаПо,"ДФ=dd.MM.yyyy"));
	Струк1.Вставить("Сумма",СуммаХранения);
	Струк1.Вставить("Ответственный",Ответственный);
	Струк1.Вставить("Оплата",Оплата);
	//Да  Сума: 550грн.	
	ОбластьМакета = Макет.ПолучитьОбласть("Таблица");
	ОбластьМакета.Параметры.Заполнить(Струк1);
	ТабДокумент.Вывести(ОбластьМакета);		
	
	
	Для Каждого Стр из Товары Цикл
		Если Стр.НомерСтроки = 1 Тогда
			Струк2 = Новый Структура;
			Струк2.Вставить("Товар",Стр.Номенклатура);
			Струк2.Вставить("Кво",Строка(Стр.Количество)+" шт.");
			ОбластьМакета = Макет.ПолучитьОбласть("Товар1");
			ОбластьМакета.Параметры.Заполнить(Струк2);
			ТабДокумент.Вывести(ОбластьМакета);		
			
		Иначе
			Струк2 = Новый Структура;
			Струк2.Вставить("Товар",Стр.Номенклатура);
			Струк2.Вставить("Кво",Строка(Стр.Количество)+" шт.");
			ОбластьМакета = Макет.ПолучитьОбласть("Товар2");
			ОбластьМакета.Параметры.Заполнить(Струк2);
			ТабДокумент.Вывести(ОбластьМакета);		
			
			
		КонецЕслИ;
	КонецЦикла;		
	Струк1 = Новый Структура;
	Струк1.Вставить("Телефон",Сделка.Телефон);
	Струк1.Вставить("ДоверенноеЛицо",Контрагент.Наименование);
	//+БП: d.matyash (21.02.2025) <>
	//Струк1.Вставить("Номер",Номер);
	//------------------------------     
	Струк1.Вставить("Номер",НомерПервичногоПриема);
	//-БП: d.matyash (21.02.2025) <>
	Струк1.Вставить("Период","с "+Формат(ДатаС,"ДФ=dd.MM.yyyy")+" по "+Формат(ДатаПо,"ДФ=dd.MM.yyyy"));
	Струк1.Вставить("Сумма",СуммаХранения);
	Струк1.Вставить("Ответственный",Ответственный);
	Струк1.Вставить("Оплата",Оплата);
	//Да  Сума: 550грн.	
	ОбластьМакета = Макет.ПолучитьОбласть("Таблица");
	ОбластьМакета.Параметры.Заполнить(Струк1);
	ТабДокумент.Вывести(ОбластьМакета);		
	
	
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()



// Процедура осуществляет печать документа. Можно направить печать на
// экран или принтер, а также распечатать необходмое количество копий.
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "ДоговорСезонногоХранения" Тогда
		ТабДокумент = ПечатьДоговора();
	ИначеЕсли ИмяМакета = "ДоговорСезонногоХраненияУКР" Тогда
		ТабДокумент = ПечатьДоговораУкр();
		
	ИначеЕсли ИмяМакета = "АктПередачи" Тогда
		ТабДокумент = ПечатьАкта();
	ИначеЕсли ИмяМакета = "АктПередачиЮ" Тогда
		ТабДокумент = ПечатьАктаЮ();
	//+БП: d.matyash (23.02.2025) <>
	ИначеЕсли ИмяМакета = "АктПриемаДоговор" Тогда
		ТабДокумент = ПечатьАктПриемаДоговор();
	//-БП: d.matyash (23.02.2025) <>
	ИначеЕсли ИмяМакета = "Стикера" Тогда
		ТабДокумент = Стикера();
		
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		 Телефон = УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Контрагент);
	 КонецЕсли; 
	 
	 Если РежимЗаписи = РежимЗаписиДокумента.Проведение и дата > '20231001000000'Тогда
		//для Каждого Стр из Товары Цикл
			Если не ЗначениеЗаполнено(Сезон) Тогда
				Сообщить("Не указан сезон");
				Отказ = истина;
			КонецЕсли;
			Если не ЗначениеЗаполнено(СостояниеТовара) Тогда
				Сообщить("Не указано состояние товара");
				Отказ = истина;
			КонецЕсли;
		//КонецЦикла;
	КонецЕсли; 
	
	//+БП: d.matyash (20.02.2025) <>
	ОбработатьКонтрагента(); 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ЭтоНовый() тогда
		ОбработатьЗаказПокупателя(РежимЗаписи);                            
	КонецЕсли;
	Если ЭтоНовый() и НомерПродления = 0 тогда
		НомерПервичногоПриема = Номер;
	КонецЕсли;
	//-БП: d.matyash (20.02.2025) <>
КонецПроцедуры  

Процедура ОбработатьЗаказПокупателя(РежимЗаписи)
	//+БП: d.matyash (20.02.2025) <>
	НовыйЗаказ = Ложь;
	ЗаказПокупателя = Сделка;
	Если ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка() тогда
		ЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
		ЗаказПокупателя.ДатаСоздания = ТекущаяДата();
		ЗаказПокупателя.Создал = ПараметрыСеанса.ТекущийПользователь; 
		НовыйЗаказ = Истина; 
	Иначе
		ЗаказПокупателя = Сделка.ПолучитьОбъект();
	КонецЕсли;                                                        
	
	ЗаказПокупателя.Дата = Дата;
	ЗаказПокупателя.СкладГруппа = Склад;
	ЗаказПокупателя.Статус = Справочники.Статусы.Создан;
	ЗаказПокупателя.Контрагент = Контрагент;
	ЗаказПокупателя.Организация = Организация;
	ЗаказПокупателя.Подразделение = Подразделение;
	ЗаказПокупателя.КратностьВзаиморасчетов = 1;
	ЗаказПокупателя.КурсВзаиморасчетов = 1;
    ЗаказПокупателя.ДатаОтгрузки = ДатаПеремещения;  
	ЗаказПокупателя.УсловиеПоставки = УсловиеПоставки;
	ЗаказПокупателя.ТипЦен = ТипЦен;
	ЗаказПокупателя.УсловиеПриема = УсловиеПриема;
	ЗаказПокупателя.ФормаРасчета = ФормаРасчета; 
	ЗаказПокупателя.СтруктурнаяЕдиница = ФормаРасчета.ОсновнойБанковскийСчет;
	ЗаказПокупателя.Телефон = Телефон;
	ЗаказПокупателя.Ответственный = Ответственный; 
	ЗаказПокупателя.ОтветственныйМенеджер = ПараметрыСеанса.ТекущийПользователь;
	ЗаказПокупателя.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("980",,,);
	ЗаказПокупателя.ДатаОтгрузки = ДатаПо;
	//ЗаказПокупателя.ВремяС = ДатаС;
	//ЗаказПокупателя.ВремяПо = ДатаПо; 	
	ЗаказПокупателя.УчитыватьНДС = Истина;
	ЗаказПокупателя.СуммаВключаетНДС = Организация.СуммаВключаетНДС ; 
	Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ЗаказПокупателя.АвторасчетНДС = Истина;
	КонецЕсли; 
   	ЗаказПокупателя.ДатаИзменения = ТекущаяДата();
	ЗаказПокупателя.Изменил = ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗначениеЗаполнено(Контрагент) тогда
		БП_ОбщийМодуль.ПоискСозданиеДоговора(ЗаказПокупателя,Организация,Контрагент);	
	КонецЕсли;  
	

	
	//+БП: d.matyash (03.12.2024) <> 
	БП_ОбщийМодуль.ИзменитьОрганизацию(ЗаказПокупателя, Ложь,Истина,Истина);	    				
    //-БП: d.matyash (03.12.2024) <>

	
	ТоварыПрием = Товары.Выгрузить(,"ВидУслуги,Количество,Сумма");
	ТоварыПрием.Свернуть("ВидУслуги","Количество,Сумма");
	ЗаказПокупателя.Услуги.Очистить();
	
	Для Каждого Стр из ТоварыПрием Цикл
		СтрН = ЗаказПокупателя.Услуги.Добавить();
		СтрН.Номенклатура = Стр.ВидУслуги.Номенклатура;
		СтрН.Содержание = Стр.ВидУслуги;
		СтрН.Количество = 1; 
		СтрН.Сумма = Стр.Сумма;
		СтрН.Цена = Стр.Сумма ;
		//СтрН.ЕдиницаИзмерения = СтрН.Номенклатура.ЕдиницаХраненияОстатков;
		//СтрН.ЕдиницаИзмеренияМест = СтрН.Номенклатура.ЕдиницаХраненияОстатков;
		//СтрН.КоличествоМест = Стр.Количество;
		//СтрН.Коэффициент = СтрН.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
		
		Если Организация.УчитыватьНДС Тогда
			СтрН.СтавкаНДС = перечисления.СтавкиНДС.НДС20;
		ИначеЕсли Организация.СуммаВключаетНДС Тогда
			СтрН.СтавкаНДС = перечисления.СтавкиНДС.НДС20;	
		Иначе
			СтрН.СтавкаНДС = перечисления.СтавкиНДС.БезНДС;
		конецесли;                     	
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрН, ЗаказПокупателя);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрН, ЗаказПокупателя);
	КонецЦикла;
	
	ЗаказПокупателя.СуммаДокумента = ЗаказПокупателя.Товары.Итог("Сумма");
	ЗаказПокупателя.КОплате = ЗаказПокупателя.СуммаДокумента;
	
	Если ЭтоНовый() Тогда
		СсылкаНового = ПолучитьСсылкуНового();
		Если не ЗначениеЗаполнено(СсылкаНового) Тогда
			СсылкаНового = Документы.ПриемТовараНаХранение.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли; 
		ЗаказПокупателя.ДокументОснование = СсылкаНового;
	Иначе
		ЗаказПокупателя.ДокументОснование = Ссылка;
	КонецЕсли;

	Попытка
		ЗаказПокупателя.ПометкаУдаления = ПометкаУдаления;
		ЗаказПокупателя.Записать(РежимЗаписи);
	    Сообщить("Документ замовлення покупця було успішно " + ?(НовыйЗаказ,"створено!","перезаповнено!")); 
		Сделка = ЗаказПокупателя.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//-БП: d.matyash (20.02.2025) <>
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Сделка = Документы.ЗаказПокупателя.ПустаяСсылка();
КонецПроцедуры

Процедура ОбработатьКонтрагента()
	//+БП: d.matyash (25.02.2025) <>	
	Если ТипЗнч(контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		 Телефон = СтрЗаменить(Телефон," ","");
		 Телефон = СтрЗаменить(Телефон,"-","");
		 Телефон = СтрЗаменить(Телефон,"-","");
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтактнаяИнформация.Объект.Код КАК Код,
		               |	КонтактнаяИнформация.Объект,
		               |	КонтактнаяИнформация.Вид,
		               |	КонтактнаяИнформация.Представление
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	ПОДСТРОКА(КонтактнаяИнформация.Представление, 1, 20) ПОДОБНО &Телефон";
		Запрос.УстановитьПараметр("Телефон","%"+Прав(Телефон,9));
		Рез = Запрос.Выполнить().Выгрузить().ВыбратьСтроку("Контрагент уже есть в базе, выберите контрагента");
		Если Не ЗначениеЗаполнено(Рез) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Контрагента нету в базе, создать нового?";
			Ответ = Вопрос(Текст, Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			КонтрагентН = Справочники.Контрагенты.СоздатьЭлемент();
			КонтрагентН.Наименование = Контрагент;
			КонтрагентН.НаименованиеПолное = Контрагент;
			КонтрагентН.Покупатель = Истина;
			КонтрагентН.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			КонтрагентН.Родитель = Справочники.Контрагенты.НайтиПоКоду("000000003").Ссылка;
			КонтрагентН.Розница = Истина;
			КонтрагентН.Записать();
			ДоговорН = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			ДоговорН.Наименование = "Договір";
			ДоговорН.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
			ДоговорН.Организация = Организация;
			ДоговорН.Владелец = КонтрагентН.Ссылка;
			ДоговорН.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			//+БП: d.matyash (23.10.2024) <>
			ДоговорН.БП_ТипДоговора = Справочники.БП_ТипыДоговоровКонтрагентов.Стандартный;	
			//-БП: d.matyash (23.10.2024) <>
			ДоговорН.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
			ДоговорН.Записать();
			КонтрагентН.ОсновнойДоговорКонтрагента = ДоговорН.Ссылка;
			КонтрагентН.Записать();
			Контрагент = КонтрагентН.Ссылка;
			ДоговорКонтрагента = ДоговорН.Ссылка;
			Если ТипЗнч(контрагент) =  Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(контрагент) Тогда
				Отбор1 = Новый Структура("Объект");
				Отбор1.Объект = Контрагент; 
				Рег = РегистрыСведений.КонтактнаяИнформация.Выбрать(Отбор1);
				Пока Рег.Следующий() Цикл
					Если Рег.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
						РегГ = Рег.ПолучитьМенеджерЗаписи();
						РегГ.Удалить();
					КонецЕсли;
				КонецЦикла;
				РегГ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				РегГ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				Регг.Объект = Контрагент;
				Регг.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				Регг.Поле1 = Телефон;
				Регг.Представление = Телефон;
				Регг.Записать();
			КонецЕслИ;
		Иначе
		Контрагент = Рез.Объект;
		//ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;
		КонецЕсли; 
		
	КонецЕслИ;
	//-БП: d.matyash (25.02.2025) <>
КонецПроцедуры
